In [1]:
import pandas as pd

In [2]:
india_weather = pd.DataFrame({
    'city': ['mumbai', 'delhi', 'bangalore'],
    'temperature': [32, 45, 30],
    'humidity': [80, 60, 78]
})

In [3]:
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [4]:
us_weather = pd.DataFrame({
    'city': ['new york', 'chicago', 'orlando'],
    'temperature': [21, 14, 35],
    'humidity': [68, 65, 75]
})

In [5]:
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

<h2>Data Frame Concatenation</h2>

In [6]:
df = pd.concat([india_weather, us_weather])

In [7]:
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0   new york           21        68
1    chicago           14        65
2    orlando           35        75

<h2>To have a continuous index by excluding the index in the dataframe concatenation</h2>

In [8]:
df = pd.concat([india_weather, us_weather], ignore_index = True)

In [9]:
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           21        68
4    chicago           14        65
5    orlando           35        75

<h2>Creating keys</h2>

In [10]:
df = pd.concat([india_weather, us_weather], keys = ['india', 'us'])

In [11]:
df

              city  temperature  humidity
india 0     mumbai           32        80
      1      delhi           45        60
      2  bangalore           30        78
us    0   new york           21        68
      1    chicago           14        65
      2    orlando           35        75

In [12]:
df.loc['india']

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [13]:
df.loc['us']

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [15]:
temperature_df = pd.DataFrame({
    'city': ['mumbai', 'delhi', 'bangalore'],
    'temperature': [32, 45, 30],
})

In [17]:
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [34]:
windspeed_df = pd.DataFrame({
    'city': ['mumbai', 'delhi', 'bangalore'],
    'windspeed': [7, 12, 9],
})

In [21]:
windspeed_df

        city  windspeed
0     mumbai          7
1      delhi         12
2  bangalore          9

In [24]:
df = pd.concat([temperature_df, windspeed_df])

In [26]:
df

        city  temperature  windspeed
0     mumbai         32.0        NaN
1      delhi         45.0        NaN
2  bangalore         30.0        NaN
0     mumbai          NaN        7.0
1      delhi          NaN       12.0
2  bangalore          NaN        9.0

<h2>Appending the table as a column instead of rows (axis = 1)</h2>

In [29]:
df = pd.concat([temperature_df, windspeed_df], axis = 1)
df

        city  temperature       city  windspeed
0     mumbai           32     mumbai          7
1      delhi           45      delhi         12
2  bangalore           30  bangalore          9

<h2>If two tables have different arrangements and record positions</h2>

In [31]:
temperature_df2 = pd.DataFrame({
    'city': ['delhi', 'mumbai', 'chennai'],
    'temperature': [32, 45, 30],
})

In [35]:
windspeed_df2 = pd.DataFrame({
    'city': ['mumbai', 'delhi'],
    'windspeed': [7, 12],
})

In [37]:
temperature_df2

      city  temperature
0    delhi           32
1   mumbai           45
2  chennai           30

In [39]:
windspeed_df2

     city  windspeed
0  mumbai          7
1   delhi         12

In [43]:
df = pd.concat([temperature_df2, windspeed_df2], axis = 1)
df

      city  temperature    city  windspeed
0    delhi           32  mumbai        7.0
1   mumbai           45   delhi       12.0
2  chennai           30     NaN        NaN

<h2>Creating indexes for cities to concat them</h2>

In [45]:
temperature_df2 = pd.DataFrame({
    'city': ['delhi', 'mumbai', 'chennai'],
    'temperature': [32, 45, 30],
}, index = [0, 1, 2])

In [49]:
windspeed_df2 = pd.DataFrame({
    'city': ['mumbai', 'delhi'],
    'windspeed': [7, 12],
}, index = [1, 0])

In [51]:
temperature_df2

      city  temperature
0    delhi           32
1   mumbai           45
2  chennai           30

In [52]:
windspeed_df2

     city  windspeed
1  mumbai          7
0   delhi         12

In [53]:
df = pd.concat([temperature_df2, windspeed_df2], axis = 1)
df

      city  temperature    city  windspeed
0    delhi           32   delhi       12.0
1   mumbai           45  mumbai        7.0
2  chennai           30     NaN        NaN

<h2>Creating a Series named 'event' and concatenating it with the temperature table</h2>

In [57]:
s = pd.Series(['humid', 'Dry', 'Rain'], name = 'event')

In [59]:
s

0    humid
1      Dry
2     Rain
Name: event, dtype: object

In [66]:
df = pd.concat([temperature_df, s], axis = 1)
df

        city  temperature  event
0     mumbai           32  humid
1      delhi           45    Dry
2  bangalore           30   Rain

In [64]:
df = pd.concat([temperature_df, windspeed_df, s], axis = 1)
df

        city  temperature       city  windspeed  event
0     mumbai           32     mumbai          7  humid
1      delhi           45      delhi         12    Dry
2  bangalore           30  bangalore          9   Rain